RubymineProjects/Webb-API-Fail/app/controllers/creator_controller.rb

def show
  #@creator = Creator.find_by_id(params[:id])
  @creator = Creator.find(params[:id])
---
SELECT  "creators".* FROM "creators" WHERE "creators"."id" = ? LIMIT 1  [["id", 1]]